{"timestamp": "2025-02-06T18:54:55.294599", "data": [{"title": "Who’s Behind the Seized Forums ‘Cracked’ & ‘Nulled’?", "url": "https://krebsonsecurity.com/2025/02/whos-behind-the-seized-forums-cracked-nulled/", "source": "Krebs on Security", "summary": "The FBI joined authorities across Europe last week in seizing domain names for Cracked and Nulled, English-language cybercrime forums with millions of users that trafficked in stolen data, hacking tools and malware. An investigation into the history of these communities shows their apparent co-founders quite openly operate an Internet service provider and a pair of e-commerce platforms catering to buyers and sellers on both forums. On Jan. 30, the U.S. Department of Justice said it seized eight domain names that were used to operate Cracked, a cybercrime forum that sprang up in 2018 and attracted more than four million users. The DOJ said the law enforcement action, dubbed Operation Talent, also seized domains tied to Sellix, Cracked’s payment processor. In addition, the government seized the domain names for two popular anonymity services that were heavily advertised on Cracked and Nulled and allowed customers to rent virtual servers: StarkRDP[.]io, and rdp[.]sh. Those archived webpages show both RDP services were owned by an entity called 1337 Services Gmbh. According to corporate records compiled by Northdata.com, 1337 Services GmbH is also known as AS210558 and is incorporated in Hamburg, Germany. The Cracked forum administrator went by the nicknames “FlorainN” and “StarkRDP” on multiple cybercrime forums. Meanwhile, a LinkedIn profile for a Florian M. from Germany refers to this person as the co-founder of Sellix and founder of 1337 Services GmbH. Northdata’s business profile for 1337 Services GmbH shows the company is controlled by two individuals: 32-year-old Florian Marzahl and Finn Alexander Grimpe, 28. Neither Marzahl nor Grimpe responded to requests for comment. But Grimpe’s first name is interesting because it corresponds to the nickname chosen by the founder of Nulled, who goes by the monikers “Finn” and “Finndev.” NorthData reveals that Grimpe was the founder of a German entity called DreamDrive GmbH, which rented out high-end sports cars and motorcycles. According to the cyber intelligence firm Intel 471, a user named Finndev registered on multiple cybercrime forums, including Raidforums [seized by the FBI in 2022], Void[.]to, and vDOS, a DDoS-for-hire service that was shut down in 2016 after its founders were arrested. The email address used for those accounts was f.grimpe@gmail.com. DomainTools.com reports f.grimpe@gmail.com was used to register at least nine domain names, including nulled[.]lol and nulled[.]it. Neither of these domains were among those seized in Operation Talent. Intel471 finds the user FlorainN registered across multiple cybercrime forums using the email address olivia.messla@outlook.de. The breach tracking service Constella Intelligence says this email address used the same password (and slight variations of it) across many accounts online — including at hacker forums — and that the same password was used in connection with dozens of other email addresses, such as florianmarzahl@hotmail.de, and fmarzahl137@gmail.com. The Justice Department said the Nulled marketplace had more than five million members, and has been selling stolen login credentials, stolen identification documents and hacking services, as well as tools for carrying out cybercrime and fraud, since 2016. Perhaps fittingly, both Cracked and Nulled have been hacked over the years, exposing countless private messages between forum users. A review of those messages archived by Intel 471 showed that dozens of early forum members referred privately to Finndev as the owner of shoppy[.]gg, an e-commerce platform that caters to the same clientele as Sellix. Shoppy was not targeted as part of Operation Talent, and its website remains online. Northdata reports that Shoppy’s business name — Shoppy Ecommerce Ltd. — is registered at an address in Gan-Ner, Israel, but there is no ownership information about this entity. Shoppy did not respond to requests for comment. Constella found that a user named Shoppy registered on Cracked in 2019 using the email address finn@shoppy[.]gg. Constella says that email address is tied to a Twitter/X account for Shoppy Ecommerce in Israel. The DOJ said one of the alleged administrators of Nulled, a 29-year-old Argentinian national named Lucas Sohn, was arrested in Spain. The government has not announced any other arrests or charges associated with Operation Talent. Indeed, both StarkRDP and FloraiN have posted to their accounts on Telegram that there were no charges levied against the proprietors of 1337 Services GmbH. FlorainN told former customers they were in the process of moving to a new name and domain for StarkRDP, where existing accounts and balances would be transferred. “StarkRDP has always been operating by the law and is not involved in any of these alleged crimes and the legal process will confirm this,” the StarkRDP Telegram account wrote on January 30. “All of your servers are safe and they have not been collected in this operation. The only things that were seized is the website server and our domain. Unfortunately, no one can tell who took it and with whom we can talk about it. Therefore, we will restart operation soon, under a different name, to close the chapter [of] ‘StarkRDP.'” This is sad thank you brian. nice opsec lawl .lol, .gag, .etc ‘The .to top-level domain was widely commercialized in 1997 by the San Francisco company Tonic Corp. (founded by Eric Gullichsen and Eric Lyons) which would sell domains at $100 per unit. They operated with the approval of Prince Siaosi, then-Crown Prince of Tonga. Network Solutions was already selling .to domains, but in a very chaotic fashion. Domain requests were processed by the Tongan consulate in San Francisco.’ Historically, this has been a real problem for island nations in the Pacific Region in the past, attracting predatory behaviour from both well intentioned and malicious actors. Apart from Australia, New Zealand and Fiji, there are at least 16 other Sovereign or Territorial Dependent nations that could be targeted in this way. When you have very low GDPs, poor local infrastucture and communities steeped in poverty, it is easy to understand why local officials are not hesitant to accept the vast sums of money offered to them in return for control of their TLDs. It’s a good point, and $100 a pop from an infinite source of macguffin is pretty easy to part with when you’re an island nation that can use the cash and has no idea what the internet is. And that’s before we start making them up from scratch just to feed the ipv6 beast. Brian you can also find this Finn Grimpe character has a court case under his company ‘HostPlanet’ from 2016. Looking into this more, it was known since then that he was the owner. He was likely turned and made it into a honeypot ever since considering he and florian (aka “Jason”) have not been arrested and only a single admin was. Opsec is dead. Literally putting your real name into your username and in your email haha. Time and time again these guys fail in the most spectacular of ways. The article sheds light on the people behind “Cracked” and “Nulled” forums, exploring their role in online security and the consequences of their actions. Interesting read! It’s eye-opening to learn about the people behind these forums and how they’ve impacted online security", "category": "Uncategorized"}, {"title": "FBI, Dutch Police Disrupt ‘Manipulaters’ Phishing Gang", "url": "https://krebsonsecurity.com/2025/01/fbi-dutch-police-disrupt-manipulaters-phishing-gang/", "source": "Krebs on Security", "summary": "The FBI and authorities in The Netherlands this week seized dozens of servers and domains for a hugely popular spam and malware dissemination service operating out of Pakistan. The proprietors of the service, who use the collective nickname “The Manipulaters,” have been the subject of three stories published here since 2015. The FBI said the main clientele are organized crime groups that try to trick victim companies into making payments to a third party. On January 29, the FBI and the Dutch national police seized the technical infrastructure for a cybercrime service marketed under the brands Heartsender, Fudpage and Fudtools (and many other “fud” variations). The “fud” bit stands for “Fully Un-Detectable,” and it refers to cybercrime resources that will evade detection by security tools like antivirus software or anti-spam appliances. The Dutch authorities said 39 servers and domains abroad were seized, and that the servers contained millions of records from victims worldwide — including at least 100,000 records pertaining to Dutch citizens. A statement from the U.S. Department of Justice refers to the cybercrime group as Saim Raza, after a pseudonym The Manipulaters communally used to promote their spam, malware and phishing services on social media. “The Saim Raza-run websites operated as marketplaces that advertised and facilitated the sale of tools such as phishing kits, scam pages and email extractors often used to build and maintain fraud operations,” the DOJ explained. The core Manipulaters product is Heartsender, a spam delivery service whose homepage openly advertised phishing kits targeting users of various Internet companies, including Microsoft 365, Yahoo, AOL, Intuit, iCloud and ID.me, to name a few. The government says transnational organized crime groups that purchased these services primarily used them to run business email compromise (BEC) schemes, wherein the cybercrime actors tricked victim companies into making payments to a third party. “Those payments would instead be redirected to a financial account the perpetrators controlled, resulting in significant losses to victims,” the DOJ wrote. “These tools were also used to acquire victim user credentials and utilize those credentials to further these fraudulent schemes. The seizure of these domains is intended to disrupt the ongoing activity of these groups and stop the proliferation of these tools within the cybercriminal community.” KrebsOnSecurity first wrote about The Manipulaters in May 2015, mainly because their ads at the time were blanketing a number of popular cybercrime forums, and because they were fairly open and brazen about what they were doing — even who they were in real life. We caught up with The Manipulaters again in 2021, with a story that found the core employees had started a web coding company in Lahore called WeCodeSolutions — presumably as a way to account for their considerable Heartsender income. That piece examined how WeCodeSolutions employees had all doxed themselves on Facebook by posting pictures from company parties each year featuring a large cake with the words FudCo written in icing. A follow-up story last year about The Manipulaters prompted messages from various WeCodeSolutions employees who pleaded with this publication to remove stories about them. The Saim Raza identity told KrebsOnSecurity they were recently released from jail after being arrested and charged by local police, although they declined to elaborate on the charges. The Manipulaters never seemed to care much about protecting their own identities, so it’s not surprising that they were unable or unwilling to protect their own customers. In an analysis released last year, DomainTools.com found the web-hosted version of Heartsender leaked an extraordinary amount of user information to unauthenticated users, including customer credentials and email records from Heartsender employees. DomainTools also uncovered evidence that the computers used by The Manipulaters were all infected with the same password-stealing malware, and that vast numbers of credentials were stolen from the group and sold online. “Ironically, the Manipulaters may create more short-term risk to their own customers than law enforcement,” DomainTools wrote. “The data table ‘User Feedbacks’ (sic) exposes what appear to be customer authentication tokens, user identifiers, and even a customer support request that exposes root-level SMTP credentials–all visible by an unauthenticated user on a Manipulaters-controlled domain.” Police in The Netherlands said the investigation into the owners and customers of the service is ongoing. “The Cybercrime Team is on the trail of a number of buyers of the tools,” the Dutch national police said. “Presumably, these buyers also include Dutch nationals. The investigation into the makers and buyers of this phishing software has not yet been completed with the seizure of the servers and domains.” U.S. authorities this week also joined law enforcement in Australia, France, Greece, Italy, Romania and Spain in seizing a number of domains for several long-running cybercrime forums and services, including Cracked and Nulled. According to a statement from the European police agency Europol, the two communities attracted more than 10 million users in total. Other domains seized as part of “Operation Talent” included Sellix, an e-commerce platform that was frequently used by cybercrime forum members to buy and sell illicit goods and services. Wow! Just … wow. Amazing article. Thanks, Brian. You said it all, Donna. It’s kind of ironic to be praising the Dutch for recognizing a Tulip Bubble when they see one, but word seems to be getting around in the Law Enforcement Community. The united states government (the international law by now probably) is so blatantly over reaching… crazy. thankfully police and courts still remain independent and have to follow local laws. Transnational organised crime by its very nature (and naming convention) is syndicated criminal groups operating in tandem across borders. So when domestic investigators chasing leads, find themselves in another jurisdiction, their hands are tied and cannot act without the collaboration of local law enforcement in that jurisdiction. I don’t know what is so hard to understand about that, seriously, Interpol has been around since 1923. These fools think they are safe operating out of Pakistan, but if they were coordinating off hardware based out of The Netherlands and targeting victims in the US, well more fool them. It looks like the Dutch have taken point on this and seized their local servers/domains but the US DOJ will hound them for the rest of their lives for reparations and I for one don’t have a problem with that. What’s overreaching about seizing domains linked to scammers breaking local and international laws? Nothing at all, silly. Those seizures go through the courts just like anything else. wth is even this, a birthday cake? stolen accounts? ehhhh, of course they never cared? anyway hopefully we’ll hear more news about nulled soon Brian, is there any news about the seizures of cracked[.]io, cracked[.]to, nulled [.]to, starkrdp[.]io, mysellix[.]io, and individuals behind them? I’m also awaiting more information on this from krebs. All these other news articles rehashes on the topic don’t do it the “krebs deep dive” it deserves normally, Brian is fairly open with content and not shy of naming names. I suspect that in this case, authorities may have asked him to withhold some of that due to ongoing investigation. To be quite honest, when I read this article, I did feel a wee bit more compassion with the perpetrators, maybe because they were not shown with pictures showing an unsympathetic person with their overpriced sportscar, but rather a corporate cake, which shows at least some degree of being nice to their employees. I admit that’s not logical, but maybe it is because I like cake a lot 😀 Good news for a change. Thanks for your deep dive, Brian. As for the perps, I’m amazed that they stay in their sh#t countries (obviously being immune from prosecution) and then use our equipment and infrastructure to attack us. What do you expect gonna happen, dummies? This is ironic because there are thousands if not millions of illegal spam hives in the NL, and Politie refuses to do anything. The list is a mile long. because it’s not illegal. leave these people alone. netherlands is independent country. Ok, independent country, but interconnected internet. So the solution is to mandate that criminal scammers using a country as a safe haven results in that country having an “independent” internet. A localnet. They don’t necessarily have a “right” to the w3 if they’re going to abuse the system everyone else pays for, which they don’t own and independently operate.", "category": "Uncategorized"}, {"title": "Infrastructure Laundering: Blending in with the Cloud", "url": "https://krebsonsecurity.com/2025/01/infrastructure-laundering-blending-in-with-the-cloud/", "source": "Krebs on Security", "summary": "In an effort to blend in and make their malicious traffic tougher to block, hosting firms catering to cybercriminals in China and Russia increasingly are funneling their operations through major U.S. cloud providers. Research published this week on one such outfit — a sprawling network tied to Chinese organized crime gangs and aptly named “Funnull” — highlights a persistent whac-a-mole problem facing cloud services. In October 2024, the security firm Silent Push published a lengthy analysis of how Amazon AWS and Microsoft Azure were providing services to Funnull, a two-year-old Chinese content delivery network that hosts a wide variety of fake trading apps, pig butchering scams, gambling websites, and retail phishing pages. Funnull made headlines last summer after it acquired the domain name polyfill[.]io, previously the home of a widely-used open source code library that allowed older browsers to handle advanced functions that weren’t natively supported. There were still tens of thousands of legitimate domains linking to the Polyfill domain at the time of its acquisition, and Funnull soon after conducted a supply-chain attack that redirected visitors to malicious sites. Silent Push’s October 2024 report found a vast number of domains hosted via Funnull promoting gambling sites that bear the logo of the Suncity Group, a Chinese entity named in a 2024 UN report (PDF) for laundering millions of dollars for the North Korean Lazarus Group. In 2023, Suncity’s CEO was sentenced to 18 years in prison on charges of fraud, illegal gambling, and “triad offenses,” i.e. working with Chinese transnational organized crime syndicates. Suncity is alleged to have built an underground banking system that laundered billions of dollars for criminals. It is likely the gambling sites coming through Funnull are abusing top casino brands as part of their money laundering schemes. In reporting on Silent Push’s October report, TechCrunch obtained a comment from Bwin, one of the casinos being advertised en masse through Funnull, and Bwin said those websites did not belong to them. Gambling is illegal in China except in Macau, a special administrative region of China. Silent Push researchers say Funnull may be helping online gamblers in China evade the Communist party’s “Great Firewall,” which blocks access to gambling destinations. Silent Push’s Zach Edwards said that upon revisiting Funnull’s infrastructure again this month, they found dozens of the same Amazon and Microsoft cloud Internet addresses still forwarding Funnull traffic through a dizzying chain of auto-generated domain names before redirecting malicious or phishous websites. Edwards said Funnull is a textbook example of an increasing trend Silent Push calls “infrastructure laundering,” wherein crooks selling cybercrime services will relay some or all of their malicious traffic through U.S. cloud providers. “It’s crucial for global hosting companies based in the West to wake up to the fact that extremely low quality and suspicious web hosts based out of China are deliberately renting IP space from multiple companies and then mapping those IPs to their criminal client websites,” Edwards told KrebsOnSecurity. “We need these major hosts to create internal policies so that if they are renting IP space to one entity, who further rents it to host numerous criminal websites, all of those IPs should be reclaimed and the CDN who purchased them should be banned from future IP rentals or purchases.” Reached for comment, Amazon referred this reporter to a statement Silent Push included in a report released today. Amazon said AWS was already aware of the Funnull addresses tracked by Silent Push, and that it had suspended all known accounts linked to the activity. Amazon said that contrary to implications in the Silent Push report, it has every reason to aggressively police its network against this activity, noting the accounts tied to Funnull used “fraudulent methods to temporarily acquire infrastructure, for which it never pays. Thus, AWS incurs damages as a result of the abusive activity.” “When AWS’s automated or manual systems detect potential abuse, or when we receive reports of potential abuse, we act quickly to investigate and take action to stop any prohibited activity,” Amazon’s statement continues. “In the event anyone suspects that AWS resources are being used for abusive activity, we encourage them to report it to AWS Trust & Safety using the report abuse form. In this case, the authors of the report never notified AWS of the findings of their research via our easy-to-find security and abuse reporting channels. Instead, AWS first learned of their research from a journalist to whom the researchers had provided a draft.” Microsoft likewise said it takes such abuse seriously, and encouraged others to report suspicious activity found on its network. “We are committed to protecting our customers against this kind of activity and actively enforce acceptable use policies when violations are detected,” Microsoft said in a written statement. “We encourage reporting suspicious activity to Microsoft so we can investigate and take appropriate actions.” Richard Hummel is threat intelligence lead at NETSCOUT. Hummel said it used to be that “noisy” and frequently disruptive malicious traffic — such as automated application layer attacks, and “brute force” efforts to crack passwords or find vulnerabilities in websites — came mostly from botnets, or large collections of hacked devices. But he said the vast majority of the infrastructure used to funnel this type of traffic is now proxied through major cloud providers, which can make it difficult for organizations to block at the network level. “From a defenders point of view, you can’t wholesale block cloud providers, because a single IP can host thousands or tens of thousands of domains,” Hummel said. In May 2024, KrebsOnSecurity published a deep dive on Stark Industries Solutions, an ISP that materialized at the start of Russia’s invasion of Ukraine and has been used as a global proxy network that conceals the true source of cyberattacks and disinformation campaigns against enemies of Russia. Experts said much of the malicious traffic traversing Stark’s network (e.g. vulnerability scanning and password brute force attacks) was being bounced through U.S.-based cloud providers. Stark’s network has been a favorite of the Russian hacktivist group called NoName057(16), which frequently launches huge distributed denial-of-service (DDoS) attacks against a variety of targets seen as opposed to Moscow. Hummel said NoName’s history suggests they are adept at cycling through new cloud provider accounts, making anti-abuse efforts into a game of whac-a-mole. “It almost doesn’t matter if the cloud provider is on point and takes it down because the bad guys will just spin up a new one,” he said. “Even if they’re only able to use it for an hour, they’ve already done their damage. It’s a really difficult problem.” Edwards said Amazon declined to specify whether the banned Funnull users were operating using compromised accounts or stolen payment card data, or something else. “I’m surprised they wanted to lean into ‘We’ve caught this 1,200+ times and have taken these down!’ and yet didn’t connect that each of those IPs was mapped to [the same] Chinese CDN,” he said. “We’re just thankful Amazon confirmed that account mules are being used for this and it isn’t some front-door relationship. We haven’t heard the same thing from Microsoft but it’s very likely that the same thing is happening.” Funnull wasn’t always a bulletproof hosting network for scam sites. Prior to 2022, the network was known as Anjie CDN, based in the Philippines. One of Anjie’s properties was a website called funnull[.]app. Loading that domain reveals a pop-up message by the original Anjie CDN owner, who said their operations had been seized by an entity known as Fangneng CDN and ACB Group, the parent company of Funnull. “After I got into trouble, the company was managed by my family,” the message explains. “Because my family was isolated and helpless, they were persuaded by villains to sell the company. Recently, many companies have contacted my family and threatened them, believing that Fangneng CDN used penetration and mirroring technology through customer domain names to steal member information and financial transactions, and stole customer programs by renting and selling servers. This matter has nothing to do with me and my family. Please contact Fangneng CDN to resolve it.” In January 2024, the U.S. Department of Commerce issued a proposed rule that would require cloud providers to create a “Customer Identification Program” that includes procedures to collect data sufficient to determine whether each potential customer is a foreign or U.S. person. According to the law firm Crowell & Moring LLP, the Commerce rule also would require “infrastructure as a service” (IaaS) providers to report knowledge of any transactions with foreign persons that might allow the foreign entity to train a large AI model with potential capabilities that could be used in malicious cyber-enabled activity. “The proposed rulemaking has garnered global attention, as its cross-border data collection requirements are unprecedented in the cloud computing space,” Crowell wrote. “To the extent the U.S. alone imposes these requirements, there is concern that U.S. IaaS providers could face a competitive disadvantage, as U.S. allies have not yet announced similar foreign customer identification requirements.” It remains unclear if the new White House administration will push forward with the requirements. The Commerce action was mandated as part of an executive order President Trump issued a day before leaving office in January 2021. “AWS first learned of their research from a journalist to whom the researchers had provided a draft.” Did that journalist happen to be you, Mr. Krebs? I always appreciate your reporting and this blending problem needs a response. The problem you’re describing is begging for what we are calling “DNS as the root of trust”. If you moderate and approve my this comment, the website shortcut URL goes to my blog article describing the mitigation technique with a very specific example. Thank you for the great reporting, Brian. I trust you and your readers will find it a helpful context to know that there is a new-ish approach to properly protecting users from connecting to operations that launder like this. I wrote a blog article in response to this with a very specific pig butchering scam that is still operational today, protected by a big cloud service provider. Should you approve this comment, can this URL work please: https://adamnet.io/infrastructurelaundering A secure app must be accountable for every bit in computer memory by NSA requirements in ~1980s. Rules changed with Big Tech software technologies invasion in ~1990s? “To the extent the U.S. alone imposes these requirements, there is concern that U.S. IaaS providers could face a competitive disadvantage, as U.S. allies have not yet announced similar foreign customer identification requirements.” All the more reason to do it surreptitiously at the national intelligence level. If it’s a hit on a known actor, act first. Let them build/host whatever they want in the mirrored sandbox. Route them accordingly. If it’s legit then legit people will complain, and be cleared, or not. They have no right to privacy or anonymity in hosting platforms other than what hiding between national laws allows for. If they want to host on OUR platforms, they come legit or not at all. Would this hurt the bottom line, no doubt a little bit to a fair bit. The bottom line is plenty deep enough to accommodate removing fraud and scams, AWS isn’t going to be unprofitable as a result of living with basic client security diligence. Think of the unaccounted for losses on the other end, Billions to scammers enriching the NK nuclear rollout. Our platforms reside all over the world in data centers. Analysis of Apache logs show it, with as example, attacks from AWS instances in data centers residing in SG, IN, and HK. So a miscreant sits at a laptop in Mumbai and creates an AWS account, how are we in the US going to prevent that? Laws about US/partner data being stored overseas can still apply (and need more teeth, obviously) – AWS for example exists in the US as a business that can be fined every single day they don’t comply. We can force audits, we can verify compliance. If it’s a ‘foreign’ uncooperative country’s company entirely that doesn’t exist within friendly jurisdictions, we can block it entirely. The TikTok ban is such an example where they refuse to play by our rules and ultimately must be taken down or sold to a more responsible host, full stop. There are several incremental approaches that can be taken to reign in this kind of laissez-faire PII data environment where just about anything goes, and we have yet to get serious about it on the scale that the problem requires. EU has started the ball rolling, much more needs to be done along those lines. Companies exist because we ALLOW them to use our infrastructure and deal with our users’ data, so it’s really nothing but apathetic inertia at the top when it comes to enforcing the standards we need to see. Yes, there’s a cost and a perception of business unfriendliness in regulations. If the alternative is to do no business with or be non-accessible to huge swaths of the US/EU/aligned world, they’ll either comply or they won’t. We shouldn’t be allowing the current state of affairs, bottom line, and we have the power to do things differently should we find the political will. That seems to be where this effort is falling short, not in the endless list of capabilities we have should we use them. If AWS decides it’s too difficult to protect data or follow our regulations and wants to incorporate elsewhere and have no contact with us, so be it. It would be replaced by a partner who will. It’s long past time to get serious about it, though I have little faith that the current crop of leaders are adequately educated or interested in doing anything but the bare minimum. This must change. A massive crash of our tech-economic system related to this security paradigm fail is the only motivator I see that would move the needle enough. That’s typically how we operate, after the fact. War with China would be another motivator. There’s really no reason to wait for either. Just inertia. Microsoft, Amazon, Google and Cloudflare are enabling cyber criminals and profiting from it. They pat themselves on the back for essentially printing money by automating their services and then turn around and claim ignorance when it is reported that they are hosting malicious sites. Then they claim that they can’t be held responsible for what their customers do on their platforms. In the day when anybody can spin up an instance of your OS of choice, it’s not just American cloud infrastructure providers. It’s also providers in GB, DE, FR, and NL to name just a little subset. I keep a Kali instance handy on AWS, and a second instance runs my website. It gets to the point where I don’t bother when whois or geoiplookup tell me its one of the cloud providers. I just redirect with .htaccess or block with iptables via fail2ban. It’s a worthless endeavor trying to track down or probe an attacking instance, as nothing shows up on the pointy end. If they configured it correctly…", "category": "Uncategorized"}, {"title": "A Tumultuous Week for Federal Cybersecurity Efforts", "url": "https://krebsonsecurity.com/2025/01/a-tumultuous-week-for-federal-cybersecurity-efforts/", "source": "Krebs on Security", "summary": "President Trump last week issued a flurry of executive orders that upended a number of government initiatives focused on improving the nation’s cybersecurity posture. The president fired all advisors from the Department of Homeland Security’s Cyber Safety Review Board, called for the creation of a strategic cryptocurrency reserve, and voided a Biden administration action that sought to reduce the risks that artificial intelligence poses to consumers, workers and national security. On his first full day back in the White House, Trump dismissed all 15 advisory committee members of the Cyber Safety Review Board (CSRB), a nonpartisan government entity established in February 2022 with a mandate to investigate the causes of major cybersecurity events. The CSRB has so far produced three detailed reports, including an analysis of the Log4Shell vulnerability crisis, attacks from the cybercrime group LAPSUS$, and the 2023 Microsoft Exchange Online breach. The CSRB was in the midst of an inquiry into cyber intrusions uncovered recently across a broad spectrum of U.S. telecommunications providers at the hands of Chinese state-sponsored hackers. One of the CSRB’s most recognizable names is Chris Krebs (no relation), the former director of the Cybersecurity and Infrastructure Security Agency (CISA). Krebs was fired by President Trump in November 2020 for declaring the presidential contest was the most secure in American history, and for refuting Trump’s false claims of election fraud. South Dakota Governor Kristi Noem, confirmed by the U.S. Senate last week as the new director of the DHS, criticized CISA at her confirmation hearing, TheRecord reports. Noem told lawmakers CISA needs to be “much more effective, smaller, more nimble, to really fulfill their mission,” which she said should be focused on hardening federal IT systems and hunting for digital intruders. Noem said the agency’s work on fighting misinformation shows it has “gotten far off mission” and involved “using their resources in ways that was never intended.” “The misinformation and disinformation that they have stuck their toe into and meddled with, should be refocused back onto what their job is,” she said. Moses Frost, a cybersecurity instructor with the SANS Institute, compared the sacking of the CSRB members to firing all of the experts at the National Transportation Safety Board (NTSB) while they’re in the middle of an investigation into a string of airline disasters. “I don’t recall seeing an ‘NTSB Board’ being fired during the middle of a plane crash investigation,” Frost said in a recent SANS newsletter. “I can say that the attackers in the phone companies will not stop because the review board has gone away. We do need to figure out how these attacks occurred, and CISA did appear to be doing some good for the vast majority of the federal systems.” Speaking of transportation, The Record notes that Transportation Security Administration chief David Pekoske was fired despite overseeing critical cybersecurity improvements across pipeline, rail and aviation sectors. Pekoske was appointed by Trump in 2017 and had his 5-year tenure renewed in 2022 by former President Joe Biden. AI & CRYPTOCURRENCY Shortly after being sworn in for a second time, Trump voided a Biden executive order that focused on supporting research and development in artificial intelligence. The previous administration’s order on AI was crafted with an eye toward managing the safety and security risks introduced by the technology. But a statement released by the White House said Biden’s approach to AI had hindered development, and that the United States would support AI systems that are “free from ideological bias or engineered social agendas,” to maintain leadership. The Trump administration issued its own executive order on AI, which calls for an “AI Action Plan” to be led by the assistant to the president for science and technology, the White House “AI & crypto czar,” and the national security advisor. It also directs the White House to revise and reissue policies to federal agencies on the government’s acquisition and governance of AI “to ensure that harmful barriers to America’s AI leadership are eliminated.” Trump’s AI & crypto czar is David Sacks, an entrepreneur and Silicon Valley venture capitalist who argues that the Biden administration’s approach to AI and cryptocurrency has driven innovation overseas. Sacks recently asserted that non-fungible cryptocurrency tokens and memecoins are neither securities nor commodities, but rather should be treated as “collectibles” like baseball cards and stamps. There is already a legal definition of collectibles under the U.S. tax code that applies to things like art or antiques, which can be subject to high capital gains taxes. But Joe Hall, a capital markets attorney and partner at Davis Polk, told Fortune there are no market regulations that apply to collectibles under U.S. securities law. Hall said Sacks’ comments “suggest a viewpoint that it would not be appropriate to regulate these things the way we regulate securities.” The new administration’s position makes sense considering that the Trump family is deeply and personally invested in a number of recent memecoin ventures that have attracted billions from investors. President Trump and First Lady Melania Trump each launched their own vanity memecoins this month, dubbed $TRUMP and $MELANIA. The Wall Street Journal reported Thursday the market capitalization of $TRUMP stood at about $7 billion, down from a peak of near $15 billion, while $MELANIA is hovering somewhere in the $460 million mark. Just two months before the 2024 election, Trump’s three sons debuted a cryptocurrency token called World Liberty Financial. Despite maintaining a considerable personal stake in how cryptocurrency is regulated, Trump issued an executive order on January 23 calling for a working group to be chaired by Sacks that would develop “a federal regulatory framework governing digital assets, including stablecoins,” and evaluate the creation of a “strategic national digital assets stockpile.” Translation: Using taxpayer dollars to prop up the speculative, volatile, and highly risky cryptocurrency industry, which has been marked by endless scams, rug-pulls, 8-figure cyber heists, rampant fraud, and unrestrained innovations in money laundering. WEAPONIZATION & DISINFORMATION Prior to the election, President Trump frequently vowed to use a second term to exact retribution against his perceived enemies. Part of that promise materialized in an executive order Trump issued last week titled “Ending the Weaponization of the Federal Government,” which decried “an unprecedented, third-world weaponization of prosecutorial power to upend the democratic process,” in the prosecution of more than 1,500 people who invaded the U.S. Capitol on Jan. 6, 2021. On Jan. 21, Trump commuted the sentences of several leaders of the Proud Boys and Oath Keepers who were convicted of seditious conspiracy. He also issued “a full, complete and unconditional pardon to all other individuals convicted of offenses related to events that occurred at or near the United States Capitol on January 6, 2021,” which include those who assaulted law enforcement officers. The New York Times reports “the language of the document suggests — but does not explicitly state — that the Trump administration review will examine the actions of local district attorneys or state officials, such as the district attorneys in Manhattan or Fulton County, Ga., or the New York attorney general, all of whom filed cases against President Trump.” Another Trump order called “Restoring Freedom of Speech and Ending Federal Censorship” asserts: “Over the last 4 years, the previous administration trampled free speech rights by censoring Americans’ speech on online platforms, often by exerting substantial coercive pressure on third parties, such as social media companies, to moderate, deplatform, or otherwise suppress speech that the Federal Government did not approve,” the Trump administration alleged. “Under the guise of combatting ‘misinformation,’ ‘disinformation,’ and ‘malinformation,’ the Federal Government infringed on the constitutionally protected speech rights of American citizens across the United States in a manner that advanced the Government’s preferred narrative about significant matters of public debate.” Both of these executive orders have potential implications for security, privacy and civil liberties activists who have sought to track conspiracy theories and raise awareness about disinformation efforts on social media coming from U.S. adversaries. In the wake of the 2020 election, Republicans created the House Judiciary Committee’s Select Subcommittee on the Weaponization of the Federal Government. Led by GOP Rep. Jim Jordan of Ohio, the committee’s stated purpose was to investigate alleged collusion between the Biden administration and tech companies to unconstitutionally shut down political speech. The GOP committee focused much of its ire at members of the short-lived Disinformation Governance Board, an advisory board to DHS created in 2022 (the “combating misinformation, disinformation, and malinformation” quote from Trump’s executive order is a reference to the board’s stated mission). Conservative groups seized on social media posts made by the director of the board, who resigned after facing death threats. The board was dissolved by DHS soon after. In his first administration, President Trump created a special prosecutor to probe the origins of the FBI’s investigation into possible collusion between the Trump campaign and Russian operatives seeking to influence the 2016 election. Part of that inquiry examined evidence gathered by some of the world’s most renowned cybersecurity experts who identified frequent and unexplained communications between an email server used by the Trump Organization and Alfa Bank, one of Russia’s largest financial institutions. Trump’s Special Prosecutor John Durham later subpoenaed and/or deposed dozens of security experts who’d collected, viewed or merely commented on the data. Similar harassment and deposition demands would come from lawyers for Alfa Bank. Durham ultimately indicted Michael Sussman, the former federal cybercrime prosecutor who reported the oddity to the FBI. Sussman was acquitted in May 2022. Last week, Trump appointed Durham to lead the U.S. attorney’s office in Brooklyn, NY. Quinta Jurecic at Lawfare notes that while the executive actions are ominous, they are also vague, and could conceivably generate either a campaign of retaliation, or nothing at all. “The two orders establish that there will be investigations but leave open the questions of what kind of investigations, what will be investigated, how long this will take, and what the consequences might be,” Jurecic wrote. “It is difficult to draw firm conclusions as to what to expect. Whether this ambiguity is intentional or the result of sloppiness or disagreement within Trump’s team, it has at least one immediate advantage as far as the president is concerned: generating fear among the broad universe of potential subjects of those investigations.” On Friday, Trump moved to fire at least 17 inspectors general, the government watchdogs who conduct audits and investigations of executive branch actions, and who often uncover instances of government waste, fraud and abuse. Lawfare’s Jack Goldsmith argues that the removals are probably legal even though Trump defied a 2022 law that required congressional notice of the terminations, which Trump did not give. “Trump probably acted lawfully, I think, because the notice requirement is probably unconstitutional,” Goldsmith wrote. “The real bite in the 2022 law, however, comes in the limitations it places on Trump’s power to replace the terminated IGs—limitations that I believe are constitutional. This aspect of the law will make it hard, but not impossible, for Trump to put loyalists atop the dozens of vacant IG offices around the executive branch. The ultimate fate of IG independence during Trump 2.0, however, depends less on legal protections than on whether Congress, which traditionally protects IGs, stands up for them now. Don’t hold your breath.” Among the many Biden administration executive orders revoked by President Trump last week was an action from December 2021 establishing the United States Council on Transnational Organized Crime, which is charged with advising the White House on a range of criminal activities, including drug and weapons trafficking, migrant smuggling, human trafficking, cybercrime, intellectual property theft, money laundering, wildlife and timber trafficking, illegal fishing, and illegal mining. So far, the White House doesn’t appear to have revoked an executive order that former President Biden issued less than a week before President Trump took office. On Jan. 16, 2025, Biden released a directive that focused on improving the security of federal agencies and contractors, and giving the government more power to sanction the hackers who target critical infrastructure. Thank you for this excellent recap, Brian. I truly appreciate how you’ve pulled together the facts and provided links to help us look back over this past week’s actions. agree ! And… he shut all this down, just as he launched his own cryptocurrency, *and* China, suspected of the telecom hack, and announced their own, better, AI. Sold to the highest bidder? These comments are all over the place. Can someone clarify for me whether this article is left leaning or right leaning? Pro Trump or anti Trump? Is there malicious intent in the presentation of the information that I am just not smart enough to see? Thank you in advance. I see no direct attack to the person of president Trump. There IS valid criticism of his actions in the facts presented. Kinda how it should be, imo. Not sure why you’d ask about malicious intent… there isn’t any, it’s information on current political events that heavily impact the cyber realm. That’s the focus of Brian’s website, cybersecurity and surrounding technologies. average wannabe cybersecurity skid The only skid here is above. This should tell you everything you want need to know: “Krebs was fired by President Trump in November 2020 for declaring the presidential contest was the most secure in American history, and for refuting Trump’s false claims of election fraud.” Both claims are asinine. I would have fired the guy too. That was CHRISTOPHER Krebs, not the guy that runs this site. Get your facts straight. He didn’t claim BK was CK, nor did he claim CK runs this site… get your gripes straight? Both claims are completely accurate. Your comment reminds me of people who hear a politician talk but aren’t sure what to think if they didn’t see if the person has a D or R after their name. Just read the information and make your own assessment of what it means. We’d all be better off if we took in information and made our own judgements rather than be geared up to accept or reject something before we even consume the information. Thanks for your courage in doing this summary of events and background information. Thank you, Brian. Completely disappointed- this was my favorite cybersecurity blog. Dont be biased “Don’t be biased”? Ever seen the phrase “facts tend to have a liberal bias”? Brian reported on what’s going on, what do you *think* is going to happen with the corrupt, senile running a hostile takeover of the US? Seen from across the big water, the mood in this comment section does not bode well for the state of the U.S. these days. I believe the correct formula is “Our thoughts and prayers are with you all”‘. And thanks a lot Brian for your reporting. I and many others will remain tuned and continue to thoroughly enjoy your reporting. Glad to hear that all the regime cares about is cutting spending. CISA does SO much more than secure the Feds systems. There will be a lot of smaller government entities who will now be put at risk by these short sighted actions. Donald’ actions speak to his fear of the truth. Look no further than Chris Krebs statements in the 2020 election. Brian is merely pointing out the obvious, when the facts run counter to Donald’s narrative, he has to strike back. Donald has been a schemer, con man and cheat his whole life – unfortunately, he has the power to strike at those who don’t bow down to his throne. Brian – keep it going. I wish our congressional representatives had more of a backbone to speak out stronger against these actions – and maybe they will, but thank you for raising the valid points presented here. While there are valid causes for concern with some of the things that have been put in place so far, the fact that so many things were overlooked out of political convenience to try and dunk on the new administration makes this article mere propaganda with a sprinkling of facts. Funny I don’t recall Brian holding the previous administration to such a high standard. Funny how Brian only found his spine after the election. To pretend there’s no election shenanigans in 2020 when it’s clear looking at the numbers compared to the polls that there’s no way 81 million people voted in 2020 for democrats with such low approval ratings at the time. The cheating was kneecapped this election and we got back to average vote totals. Brian likes to shill for the left but when they change their narrative he thinks his readers are stupid and will believe the new narrative without question. Remember when everyone who questioned the ‘wet market’ narrative was a ‘conspiracy theorist’? Now that the CIA changed their official narrative about the events of 2020 so we can all just memory hole everything the left did to try and get their way. I urge Brian to find a better balance. If I want to read tech content from leftist shills I’d go back to Wired. Do better Brian. No one cares about your personal political beliefs. Did you take your medicine today? If yes, ask your doctor to double your dose, you really need it The possibility of Covid coming from a lab has always been considered a possibility. People who suggested that it was were not labeled “conspiracy theorists” (although the confidence that some people displayed in making the claim was out of alignment with known information). Both theories have been entertained and no investigation has ever conclusively came down on one side or the other. Even today, there is no surety. The CIA’s recent statement was made by their own categorization, in low confidence. People need to stop dragging CS into politics. A ton of the commentary here is slanted to “you’re criticizing my guy, so you suck”. There is no criticism here. All I see Brian doing in this article is recounting facts. If you have trouble with these facts, do your CS thing and verify for god’s sake. He’s not just randomly citing these things, and honestly the vast majority of the information he is citing is coming from independent, non-partisan sources. Well thought out CS takes into account the veracity of information, period. Take from that what you want, but stop screaming at the sky for being blue for the love of… “a nonpartisan government entity” – No such thing. Everyone is on some side. That’s not actually true. the white hats are back in control… trust the plan pqtriots Articulate article with references. Thank you. A rapist, insurrectionist, fascist, multi-felon running next to a Nazi sucks ass at cyber security. Who could have seen that coming? It’s not political, homeboy is a convicted criminal and one of the most deranged people on planet earth. Holy smokes! I have never seen such a group of infantile, maniacal cult members! …and I’ve been to the “Flat Earthers” booth! Not to worry, Mr. Krebs; I’m sure you’ll have an opportunity to confess your sins to our Lord and Savior, Donald Trump! In the meantime, a Trump Bible will be mailed to you to encourage you to repent! Normally I’d hope these people would comment more often (very entertaining), but this page is better as a source of intellect. Great article, thank you! Brian, I have been a reader of your column now for a long time. (I don’t have a frame of reference as to number of years but I do know I have worn out at least 4 laptops while your site has been bookmarked.) You write well, you report well without fear or favor, you are a master techie and you tie it all together by being able to tell a good story. All that said… your most recent column surprised me. In all honesty, I had hoped that you might have broached the ‘recent troubles’ with a discussion focusing on the recent mass email to all dot gov supposedly from OPM that was flagged by the gov exch servers as originating out of domain. I have no idea if there is meat on the story or not but given the cast of characters, one can’t help but be suspicious. In any event, it took courage for you to take the the approach you did in this column. It is noted! Bravo Sir. I don’t expect that you will be turning your website into a ‘political column’ but you obviously have some passion for the subject matter. If you feel the need to feed this passion by contributing to another site, please do. Let us know where you land, we will follow you. Your voice is needed. 93rd comment, Thurs, 1-10-2025, apologies in advance for making 3 comments on this story, and you have better more important things to do than to moderate this thread, and I have to admit I violated my own rule about never feeding the trolls, but consider adding if possible an upvote/downvote option for each comment, or enlisting a helper to moderate the swill of bs that you are attracting. I hate to see that here, when it has been my experience over the years of following you, that your commenters are generally positive, well-informed, professional types who are interested in the technical details of the very responsible stories and information you share. A family member who hosts a successful crime reporting website also permits comments on the site, and has to delete some comments occasionally when they abuse the privilege of civil and responsible discourse. In short, my feelings would not be hurt if you or a helper could cull out the obvious bs. Letting those who are sincere about communicating about reality also check a box whether a comment is good or bad, an obvious attempt to muddy the water, or a veiled bit of backstabbing, may not be an unproductive way of keeping the thread self-policed. Sorry you have to deal with this. I asked my brother the other day whether he had heard of the terms: doxing or swatting as a method to cyber-bully people of good faith online or in their private lives, but unfortunately he was oblivious that some bad actors sink to that low level of anti-social and anti-democratic behavior. They are cowards and lack any virtue or honor. I wish you well. sir. Thanks Brian. Reminding people of the DNS traffic is important. Seeing what happened to people who simply gave knowledgeable opinions regarding it is chilling. Great job Brian…. I love your work Brian! I have been reading CS for 15 years. This article is true to form for all your work – an impartial statement of the facts. The facts speak for themselves. Those who are offended by the facts have cause to pause for introspection and reflection. Thumps up", "category": "Uncategorized"}, {"title": "MasterCard DNS Error Went Unnoticed for Years", "url": "https://krebsonsecurity.com/2025/01/mastercard-dns-error-went-unnoticed-for-years/", "source": "Krebs on Security", "summary": "The payment card giant MasterCard just fixed a glaring error in its domain name server settings that could have allowed anyone to intercept or divert Internet traffic for the company by registering an unused domain name. The misconfiguration persisted for nearly five years until a security researcher spent $300 to register the domain and prevent it from being grabbed by cybercriminals. From June 30, 2020 until January 14, 2025, one of the core Internet servers that MasterCard uses to direct traffic for portions of the mastercard.com network was misnamed. MasterCard.com relies on five shared Domain Name System (DNS) servers at the Internet infrastructure provider Akamai [DNS acts as a kind of Internet phone book, by translating website names to numeric Internet addresses that are easier for computers to manage]. All of the Akamai DNS server names that MasterCard uses are supposed to end in “akam.net” but one of them was misconfigured to rely on the domain “akam.ne.” This tiny but potentially critical typo was discovered recently by Philippe Caturegli, founder of the security consultancy Seralys. Caturegli said he guessed that nobody had yet registered the domain akam.ne, which is under the purview of the top-level domain authority for the West Africa nation of Niger. Caturegli said it took $300 and nearly three months of waiting to secure the domain with the registry in Niger. After enabling a DNS server on akam.ne, he noticed hundreds of thousands of DNS requests hitting his server each day from locations around the globe. Apparently, MasterCard wasn’t the only organization that had fat-fingered a DNS entry to include “akam.ne,” but they were by far the largest. Had he enabled an email server on his new domain akam.ne, Caturegli likely would have received wayward emails directed toward mastercard.com or other affected domains. If he’d abused his access, he probably could have obtained website encryption certificates (SSL/TLS certs) that were authorized to accept and relay web traffic for affected websites. He may even have been able to passively receive Microsoft Windows authentication credentials from employee computers at affected companies. But the researcher said he didn’t attempt to do any of that. Instead, he alerted MasterCard that the domain was theirs if they wanted it, copying this author on his notifications. A few hours later, MasterCard acknowledged the mistake, but said there was never any real threat to the security of its operations. “We have looked into the matter and there was not a risk to our systems,” a MasterCard spokesperson wrote. “This typo has now been corrected.” Meanwhile, Caturegli received a request submitted through Bugcrowd, a program that offers financial rewards and recognition to security researchers who find flaws and work privately with the affected vendor to fix them. The message suggested his public disclosure of the MasterCard DNS error via a post on LinkedIn (after he’d secured the akam.ne domain) was not aligned with ethical security practices, and passed on a request from MasterCard to have the post removed. Caturegli said while he does have an account on Bugcrowd, he has never submitted anything through the Bugcrowd program, and that he reported this issue directly to MasterCard. “I did not disclose this issue through Bugcrowd,” Caturegli wrote in reply. “Before making any public disclosure, I ensured that the affected domain was registered to prevent exploitation, mitigating any risk to MasterCard or its customers. This action, which we took at our own expense, demonstrates our commitment to ethical security practices and responsible disclosure.” Most organizations have at least two authoritative domain name servers, but some handle so many DNS requests that they need to spread the load over additional DNS server domains. In MasterCard’s case, that number is five, so it stands to reason that if an attacker managed to seize control over just one of those domains they would only be able to see about one-fifth of the overall DNS requests coming in. But Caturegli said the reality is that many Internet users are relying at least to some degree on public traffic forwarders or DNS resolvers like Cloudflare and Google. “So all we need is for one of these resolvers to query our name server and cache the result,” Caturegli said. By setting their DNS server records with a long TTL or “Time To Live” — a setting that can adjust the lifespan of data packets on a network — an attacker’s poisoned instructions for the target domain can be propagated by large cloud providers. “With a long TTL, we may reroute a LOT more than just 1/5 of the traffic,” he said. The researcher said he’d hoped that the credit card giant might thank him, or at least offer to cover the cost of buying the domain. “We obviously disagree with this assessment,” Caturegli wrote in a follow-up post on LinkedIn regarding MasterCard’s public statement. “But we’ll let you judge— here are some of the DNS lookups we recorded before reporting the issue.” As the screenshot above shows, the misconfigured DNS server Caturegli found involved the MasterCard subdomain az.mastercard.com. It is not clear exactly how this subdomain is used by MasterCard, however their naming conventions suggest the domains correspond to production servers at Microsoft’s Azure cloud service. Caturegli said the domains all resolve to Internet addresses at Microsoft. “Don’t be like Mastercard,” Caturegli concluded in his LinkedIn post. “Don’t dismiss risk, and don’t let your marketing team handle security disclosures.” One final note: The domain akam.ne has been registered previously — in December 2016 by someone using the email address um-i-delo@yandex.ru. The Russian search giant Yandex reports this user account belongs to an “Ivan I.” from Moscow. Passive DNS records from DomainTools.com show that between 2016 and 2018 the domain was connected to an Internet server in Germany, and that the domain was left to expire in 2018. This is interesting given a comment on Caturegli’s LinkedIn post from an ex-Cloudflare employee who linked to a report he co-authored on a similar typo domain apparently registered in 2017 for organizations that may have mistyped their AWS DNS server as “awsdns-06.ne” instead of “awsdns-06.net.” DomainTools reports that this typo domain also was registered to a Yandex user (playlotto@yandex.ru), and was hosted at the same German ISP — Team Internet (AS61969). Wow, this is so vindicating. We use the Mastercard Virtual Card service for making payments. I’m fairly certain this issue was effecting email validation, as we had a lot of random payment emails get rejected for failing to match the Mastercard listed servers. They told us for months it was our problem. Probably 98% of the payments worked fine, but then we’d get a couple bounces a week. We ended up changing all the header info to avoid it, but that caused other issues. MC appears to have fallen victim to slothful practices, as evidenced by the shameful attempt to deflect responsibility and avoid finding a solution. I was once a subscriber to LifeLock services. Upon renewal, I noticed that the LifeLock website stored my credit card information (everything, including the CVV2 code) in clear text on my computer (the customer’s computer). I politely and respectfully notified LifeLock. Their response was childish and downright hostile. I would guess that their website still does that. They, and their QSA, should be ashamed. That’s bad but honestly what the fuck does this have to do with the subject of the article beyond “companies suck at security” Between your screen name and your rude response, might be better if you were neither seen nor heard. You should have reported it to the credit card company. All the major credit card companies have rules in their Merchant Agreements prohibiting storing the CVV2 code. The credit card companies will tell you to contact the issuing financial institution to report it. They in turn will report it to the credit card company, which according to the terms of the merchant agreement gives them the power to levy fines on a per violation basis. When they get their bill for credit card processing, the’d be in for a shock. Since Rob Ellison posted about LifeLock, let’s remind everyone about their bad practices: “LifeLock, an identity-theft protection company, was fined $100 million by the Federal Trade Commission (FTC) in December 2015 for violating a 2010 federal court order[1][4]. This fine represents the largest monetary award obtained by the FTC in an order enforcement action[4]. “The FTC alleged that LifeLock violated the 2010 order in four ways: 1. Failing to establish and maintain a comprehensive information security program to protect users’ sensitive personal information[4]. 2. Falsely advertising that it protected consumers’ data with the same safeguards used by financial institutions[4]. 3. Falsely claiming it would immediately alert consumers of potential identity theft[4]. 4. Failing to comply with the order’s recordkeeping requirements[4]. “Of the $100 million fine, $68 million was allocated for redress to consumers who were allegedly injured by LifeLock’s behavior[3]. The remaining funds were to cover additional settlements with state attorneys general and any leftover money would be returned to the FTC[3]. “This settlement followed a previous FTC action against LifeLock in 2010, where the company agreed to pay $35 million in total, including refunds to consumers and fines to the FTC and state attorneys general[3]. “In October 2019, the FTC began sending refund checks totaling more than $31 million to LifeLock customers as part of the settlement[5]. Citations: [1] https://phys.org/news/2015-12-identity-theft-firm-fined-mn.html [2] https://www.phoenixnewtimes.com/news/lifelock-ordered-to-pay-100-million-for-deceptive-ads-and-bad-security-7903740 [3] https://www.insideprivacy.com/data-security/ftc-obtains-record-100-million-settlement-with-lifelock/ [4] https://www.ftc.gov/news-events/news/press-releases/2015/12/lifelock-pay-100-million-consumers-settle-ftc-charges-it-violated-2010-order [5] https://www.ftc.gov/news-events/news/press-releases/2019/10/ftc-sends-checks-totaling-more-31-million-lifelock-customers [6] https://content.next.westlaw.com/practical-law/document/I02f47330a46e11e598dc8b09b4f043e0/LifeLock-to-Pay-100-Million-in-FTC-Settlement?contextData=%28sc.Default%29&transitionType=Default&viewType=FullText [7] https://www.fredlaw.com/alert-lifelock-to-pay-100-million-to-settle-ftc-charges-of-deceptive-advertising [8] https://en.wikipedia.org/wiki/LifeLock Not surprised. There was someone from my old company who outright lied to Mastercard about their role and experience. They’re now in charge of helping maintaining their infrastructure. A few concerned employees disclaimed this to Mastercard but the individual is still employed. And my old company bosses couldn’t care less. The role title was made up and the duties were all made up too. Lmfao 3 months and $300. Could have just contacted their security team or direct emailed the CIO. Comically stupid. Duh, why didn’t I think of that! Must be nice reporting vulnerabilities in your magical world where CIOs and security teams act from a single unsolicited email! hahahahaha rc, you doing alright bruh? because you look toastyyyyyy hahaha. Hey smoothbrain, why don’t you go back to watching My Little Pony and leave the conversation here to the grownups! Hey brainrot… why don’t you go back to eating that junk cereal with the other toddlers and leave the conversation to the real grownups. I agree that this article is as ridiculous as the actions of the “security expert”. Us industry professionals know this is a nothing burger with extra cheese, the rest of the World thinks they have gotten a peak behind the curtain, ads were displayed, clicks registered and the planet has been allowed to spin for yet another 24 hours. I don’t get it, why talk to MasterCard and not Akamai? While the issue was affecting MasterCard, it was also affecting others that made the same typo. Control of the domain if anything, should go to Akamai. Akamai provides a list of NS entries to the customer (Mastercard, in this case). The customer then adds them to THEIR DNS. Akamai can’t add/edit the entries in Mastercard’s DNS. The chances of reaching the right person at MC on first contact are about zero. Let me guess: All of these glaring errors are a result of DEI programs – for white coders only. Dude, overprivileged white guys make at least as many glaring errors as so-called DEI hires. There’s no monopoly on incompetence. Please run that DNS response over to ChatGPT and ask “What’s wrong with these DNS records?” I’m curious about whether our Digital Overlords would have caught it. Global and regional Mastercard CTOs plus all IT Security Personal must be FIRED immediatley! So theoretically, some evil trillionaire could purchase all available .ne addresses and “squat” until the same address with .net become registered and DNS errors start to pay out. Now I know what to do with my trillions. Thanks. So much misinformation in the article. First, the NS records point to the authoritative DNS servers. Until the misspelled domain was registered and assigned an IP through an A record, that NS record would simply not resolve and the DNS client would try another from the list. Second, NS records are _not_ used for directing email. MX records are used for that. Third, security certificates are issued to the website domain, not the nameserver domain name. It would not be a simple matter to get a valid SSL certificate for *.MasterCard.com just by controlling a DNS server. What could happen? The rogue DNS server could be configured to return records pointing to IP addresses for servers they control. Browsers trying to access MasterCard.com would load a rogue site. If they have visited mastercard.com before HSTS would generate an error. If it’s their first visit, they wouldn’t likely see the charms indicating a secure connection. Email would likely be able to be redirected to a rogue server. Last I checked SSL isn’t commonly enforced for SMTP delivery. Windows machines have SSL certificates in place to protect the domain. Windows would not have shared any credentials or other sensitive info with rogue servers. tldr;: Sure it’s bad. But the description provided in the article is incorrect and blown out of proportion. I’m surprised the article isn’t overtly sponsored by some company peddling the “solution.” Thanks for the DNS mansplaining! While some of your points are valid, they don’t actually contradict the article. The article doesn’t claim that NS records directly handle email or grant automatic access to SSL certificates. The article highlights how a rogue DNS server, resulting from this misconfiguration, could create downstream risks, such as redirecting traffic, manipulating MX/TXT/PTR records, or even enabling the issuance of DV SSL certificates under certain conditions. From my perspective, the article is written for a general audience. While it doesn’t go into technical details like MX record mechanisms or HSTS protections, that doesn’t make it inaccurate. The key takeaway remains the same: a DNS misconfiguration like this introduces risks and attack vectors that threat actors could exploit. Nothing to sell here… just trying to raise awareness about an overlooked issue. Is ‘t there something called DNSSEC to prevent stuff like that? As long as the domain is used. This domain is not even used. ‘Blah, blah, blah, blah … tldr;: Sure it’s bad. But … blah, blah, blah, blah’ I think you are contradicting yourself there Champ. If it is bad, Brian should and is raising awareness. What is your problem? Here’s my take: It’s becoming more and more normal for corporations to be dismissive or hostile towards security researchers that are simply trying to help them. It makes no sense ethically or financially, when you send people the message: “We won’t acknowledge your help, or we will even come after you for it”. Now people are inventivised to sell their exploits to someone who will be grateful: criminals. I will avoid business with MC until they apologize for their toxicity towards security researchers. I do not trust that they are secure nor do they really care to be secure based on their actions. That’s partially because of the smug satisfaction and clout chasing endemic to the world of “security researchers.” This goes way back to when hacking and cracking was a very competitive niche subculture, not a trillion-dollar industry. The performative white knighting that some “security researchers” display is clearly rooted in a need for attention and social validation of an extremely niche hobby, which is often tied up in a savior complex. I respect the guy for finding a bug, even though it seems like some Russian creep found it a long time ago, but when you copy a web journalist on your disclosure as an “insurance policy” to ensure that you’re taken seriously, it comes off as coercive. It’s easy to think of a huge multinational company as a monolithic entity, but this entity is ultimately composed of individual devs who have to fix their mistakes. The right thing to do is reach out to the company first, or use a confidential bug disclosure platform that can coordinate with the affected entity. If the bug isn’t fixed after a certain period of time, you could perhaps consider reaching out to a journalist or some other neutral third party. But when you show up at the door for your first visit with the media at your side, the person you’re visiting is probably going to question your motives. “but when you copy a web journalist on your disclosure as an “insurance policy” to ensure that you’re taken seriously, it comes off as coercive.” Coercive of what, of fixing the glaring DNS bug that could leak personal info of millions if exploited? We don’t know the full disclosure effort back/forth, but we know that when it was finally disclosed (publicly, yes) the company didn’t take it seriously (deliberate denial) and tried to silence the whistleblower on at least 1 platform. This is after the threat has been completely explained, explored and removed by said researcher. It would be BETTER PR to say “wow, thanks” and maybe even give him a $300 debit card unprompted for catching their glaring, serious, superbowl of a typo. But no, they wanted to play it down. Ever see someone trip hard on the sidewalk and try to play it off? Sure, blame the sidewalk. Philippe Caturegli in my amateur opinion you should have got payed something/anything? and a sincere thank you from MC but in this day and age that might be a long time coming. Cheers and thank you from the peanut gallery. if you are sitting on any other items involving this company i recommend you sell it to the highest bidder and let the company get burned. disgusting behaviour towards the researcher. I am an IT professional for the last 30 years working in Operations/DevOps environments. The erroneous had a TTL of 1 hour. That means that your systems is ADVISED to hold on to that record for 1 hour before checking again. The whole thing could have been cleared up in…..one hour. So, going through the heroic exercise of taking three months to secure domain in order to intercept malicious or misdirected traffic really only extended MCs exposure. The security expert could and should have alerted MC immediately if they really cared about addressing the security aspect. Notice in the article they did not want the domain, no need once you modify the record. Also, when the author discusses TTL with regard to network packets living on the network, “a setting that can adjust the lifespan of data packets on a network”, he is actually mentioning a network packet TTL. That is a completely different thing and arguably should not be called a TTL. The rest of that state, made by the author, is just scifi. It really leaves me wondering why this article was written, I guess I should follow the money. Oh nose. Lookout DevOps has arrived. Turn off all your security protocols so they can deliver all the projects they promised management, due yesterday … again. Sigh. You are aware this is Security Investigations and not a DevOps Blog? You are right in that this could have been cleared up in an hour, but it didn’t. It took 5 f*cking years! And for the response MasterCard gave to it; THAT is abysmal. In the world of Occupational Health & Safety this is equivalent to a ‘near miss’, if not for an external researcher, a reportable event with serious consequences. Where were the audits and red flags? Such a basic simple typo error, not self resolved by a corporation with US$42 billion in assets is a disgrace, and you want to sit there and defend them with ‘nothing to see here’. You my friend, are part of the problem. As long you take your six figure salary home everyday, who cares about Security right? Hey Hey, SecDevOps is here, dude went out of the way to buy the domain AFTER realizing MC was not respoding to him. So not only did MC did not perfom anual DNS record audits as defied by their security complice standards, MC also failed to review bounty reporting. For an organization of this size IF it took 1 year to respond to the issue it would be a notibe secryt breach on the annnual report, but the fact that it took 5 years … managers in multiple positions need to fired, annual insurace costs may be affected etc. It is both absurd and terrifying that it took so long to fix this. Really enjoy your articles! It’s very difficult to protect your comany’s identity by registering every possible TLD variation. Akamai.xxx anyone? Up for grabs! There are comapnies that will do it for you, it’s not cheap, and I don’t think that even includes keeping an eye on Web3 Domain variants. It’s very difficult to protect your comany’s identity by registering every possible TLD variation. Akamai.xxx anyone? Up for grabs! There are companies that will do it for you, it’s not cheap, and I don’t think that even includes keeping an eye on Web3 Domain variants. This is EXACTLY one of the problems with inventing obscure TLD’s on a whim. But the actual incident happened on .ne which wasn’t invented on a whim, it’s a country code. I get that. The point being other typos will/do exist, and more of them may become problems with ‘unlimited’ TLD additions or perhaps deliberately planned TLD additions from people who spot the useful typos. Like Constantinople applies for .con, then they register globalbanknetwork.con on that obscure TLD. Add more perturbations with fewer per capita eyeballs, expect repeats. This one was caught on a rando-whim. I can’t reply to say I realize that, but my point is other typos will exist with more TLD’s lined up. I posted about this to Mastercard’s Facebook page and it was deleted with seconds. Bugcrowd is a joke anyway. So, basically, spelling IS important? Everyone knows how to spell “net.” Anyone can make a typo. We all know how to spell the words involved. (In before “AI doesn’t make typos, should solve all problems”) Man, if all those Nigerian Prince scams back in the day had gotten a hold of this….. Wrong commeNt Since we’re talking about credit card companies and mishandled security, my story is about Citibank. They detected what they believed was a fraudulent charge on my credit card and called me. All good so far. Then they wanted me to confirm my identity by sending me a security code via SMS and have me read it to them over the phone. I tried explaining that this is how hackers get past MFA and they said they couldn’t help me without me giving them the code. I refused since I already knew the charge was legitimate. I tried escalating this but they refused to acknowledge this was a problem.", "category": "Uncategorized"}]}